[
	{
		"name": "Animate Dead",
		"source": "PHB",
		"page": 212,
		"srd": true,
		"level": 3,
		"school": "N",
		"time": [
			{
				"number": 1,
				"unit": "minute"
			}
		],
		"range": {
			"type": "point",
			"distance": {
				"type": "feet",
				"amount": 10
			}
		},
		"components": {
			"v": true,
			"s": true,
			"m": "a drop of blood, a piece of flesh, and a pinch of bone dust"
		},
		"duration": [
			{
				"type": "instant"
			}
		],
		"entries": [
			"This spell creates an undead servant. Choose a pile of bones or a corpse of a Medium or Small humanoid within range. Your spell imbues the target with a foul mimicry of life, raising it as an undead creature. The target becomes a {@creature skeleton} if you chose bones or a {@creature zombie} if you chose a corpse (the DM has the creature's game statistics).",
			"On each of your turns, you can use a bonus action to mentally command any creature you made with this spell if the creature is within 60 feet of you (if you control multiple creatures, you can command any or all of them at the same time, issuing the same command to each one). You decide what action the creature will take and where it will move during its next turn, or you can issue a general command, such as to guard a particular chamber or corridor. If you issue no commands, the creature only defends itself against hostile creatures. Once given an order, the creature continues to follow it until its task is complete.",
			"The creature is under your control for 24 hours, after which it stops obeying any command you've given it. To maintain control of the creature for another 24 hours, you must cast this spell on the creature again before the current 24-hour period ends. This use of the spell reasserts your control over up to four creatures you have animated with this spell, rather than animating a new one."
		],
		"entriesHigherLevel": [
			{
				"type": "entries",
				"name": "At Higher Levels",
				"entries": [
					"When you cast this spell using a spell slot of 4th level or higher, you animate or reassert control over two additional undead creatures for each slot level above 3rd. Each of the creatures must come from a different corpse or pile of bones."
				]
			}
		],
		"miscTags": [
			"PRM",
			"SMN"
		],
		"classes": {
			"fromClassList": [
				{
					"name": "Cleric",
					"source": "PHB"
				},
				{
					"name": "Wizard",
					"source": "PHB"
				}
			],
			"fromSubclass": [
				{
					"class": {
						"name": "Cleric",
						"source": "PHB"
					},
					"subclass": {
						"name": "Death",
						"source": "DMG"
					}
				},
				{
					"class": {
						"name": "Paladin",
						"source": "PHB"
					},
					"subclass": {
						"name": "Oathbreaker",
						"source": "DMG"
					}
				},
				{
					"class": {
						"name": "Druid",
						"source": "PHB"
					},
					"subclass": {
						"name": "Spores (UA)",
						"source": "UAThreeSubclasses"
					}
				},
				{
					"class": {
						"name": "Druid",
						"source": "PHB"
					},
					"subclass": {
						"name": "Spores",
						"source": "TCE"
					}
				}
			],
			"fromClassListVariant": [
				{
					"name": "Warlock",
					"source": "PHB",
					"definedInSource": "UAClassFeatureVariants"
				}
			]
		},
		"backgrounds": [
			{
				"name": "Golgari Agent",
				"source": "GGR"
			}
		]
	},
	{
		"name": "Crown of Madness",
		"source": "PHB",
		"page": 229,
		"level": 2,
		"school": "E",
		"time": [
			{
				"number": 1,
				"unit": "action"
			}
		],
		"range": {
			"type": "point",
			"distance": {
				"type": "feet",
				"amount": 120
			}
		},
		"components": {
			"v": true,
			"s": true
		},
		"duration": [
			{
				"type": "timed",
				"duration": {
					"type": "minute",
					"amount": 1
				},
				"concentration": true
			}
		],
		"entries": [
			"One humanoid of your choice that you can see within range must succeed on a Wisdom saving throw or become {@condition charmed} by you for the duration. While the target is {@condition charmed} in this way, a twisted crown of jagged iron appears on its head, and a madness glows in its eyes.",
			"The {@condition charmed} target must use its action before moving on each of its turns to make a melee attack against a creature other than itself that you mentally choose. The target can act normally on its turn if you choose no creature or if none are within its reach.",
			"On your subsequent turns, you must use your action to maintain control over the target, or the spell ends. Also, the target can make a Wisdom saving throw at the end of each of its turns. On a success, the spell ends."
		],
		"conditionInflict": [
			"charmed"
		],
		"savingThrow": [
			"wisdom"
		],
		"miscTags": [
			"SGT"
		],
		"areaTags": [
			"ST"
		],
		"classes": {
			"fromClassList": [
				{
					"name": "Bard",
					"source": "PHB"
				},
				{
					"name": "Sorcerer",
					"source": "PHB"
				},
				{
					"name": "Warlock",
					"source": "PHB"
				},
				{
					"name": "Wizard",
					"source": "PHB"
				}
			],
			"fromSubclass": [
				{
					"class": {
						"name": "Paladin",
						"source": "PHB"
					},
					"subclass": {
						"name": "Oathbreaker",
						"source": "DMG"
					}
				}
			]
		},
		"races": [
			{
				"name": "Tiefling (Baalzebul)",
				"source": "UAFiendishOptions",
				"baseName": "Tiefling",
				"baseSource": "PHB"
			},
			{
				"name": "Tiefling (Baalzebul)",
				"source": "MTF",
				"baseName": "Tiefling",
				"baseSource": "PHB"
			}
		],
		"backgrounds": [
			{
				"name": "Rakdos Cultist",
				"source": "GGR"
			}
		]
	},
	{
		"name": "Detect Magic",
		"source": "PHB",
		"page": 231,
		"srd": true,
		"level": 1,
		"school": "D",
		"time": [
			{
				"number": 1,
				"unit": "action"
			}
		],
		"range": {
			"type": "point",
			"distance": {
				"type": "self"
			}
		},
		"components": {
			"v": true,
			"s": true
		},
		"duration": [
			{
				"type": "timed",
				"duration": {
					"type": "minute",
					"amount": 10
				},
				"concentration": true
			}
		],
		"meta": {
			"ritual": true
		},
		"entries": [
			"For the duration, you sense the presence of magic within 30 feet of you. If you sense magic in this way, you can use your action to see a faint aura around any visible creature or object in the area that bears magic, and you learn its school of magic, if any.",
			"The spell can penetrate most barriers, but it is blocked by 1 foot of stone, 1 inch of common metal, a thin sheet of lead, or 3 feet of wood or dirt."
		],
		"classes": {
			"fromClassList": [
				{
					"name": "Bard",
					"source": "PHB"
				},
				{
					"name": "Cleric",
					"source": "PHB"
				},
				{
					"name": "Druid",
					"source": "PHB"
				},
				{
					"name": "Paladin",
					"source": "PHB"
				},
				{
					"name": "Ranger",
					"source": "PHB"
				},
				{
					"name": "Sorcerer",
					"source": "PHB"
				},
				{
					"name": "Wizard",
					"source": "PHB"
				},
				{
					"name": "Artificer (Revisited)",
					"source": "UAArtificerRevisited"
				},
				{
					"name": "Artificer",
					"source": "TCE"
				}
			],
			"fromSubclass": [
				{
					"class": {
						"name": "Cleric",
						"source": "PHB"
					},
					"subclass": {
						"name": "Arcana",
						"source": "SCAG"
					}
				},
				{
					"class": {
						"name": "Paladin",
						"source": "PHB"
					},
					"subclass": {
						"name": "Watchers",
						"source": "TCE"
					}
				}
			]
		},
		"races": [
			{
				"name": "Firbolg",
				"source": "VGM"
			},
			{
				"name": "Half-Elf (Mark of Detection)",
				"source": "ERLW",
				"baseName": "Half-Elf",
				"baseSource": "PHB"
			}
		],
		"eldritchInvocations": [
			{
				"name": "Eldritch Sight",
				"source": "PHB"
			}
		]
	},
	{
		"name": "Glyph of Warding",
		"source": "PHB",
		"page": 245,
		"srd": true,
		"level": 3,
		"school": "A",
		"time": [
			{
				"number": 1,
				"unit": "hour"
			}
		],
		"range": {
			"type": "point",
			"distance": {
				"type": "touch"
			}
		},
		"components": {
			"v": true,
			"s": true,
			"m": {
				"text": "incense and powdered diamond worth at least 200 gp, which the spell consumes",
				"cost": 20000,
				"consume": true
			}
		},
		"duration": [
			{
				"type": "permanent",
				"ends": [
					"dispel",
					"trigger"
				]
			}
		],
		"entries": [
			"When you cast this spell, you inscribe a glyph that later unleashes a magical effect. You inscribe it either on a surface (such as a table or a section of floor or wall) or within an object that can be closed (such as a book, a scroll, or a treasure chest) to conceal the glyph. The glyph can cover an area no larger than 10 feet in diameter. If the surface or object is moved more than 10 feet from where you cast this spell, the glyph is broken, and the spell ends without being triggered.",
			"The glyph is nearly invisible and requires a successful Intelligence ({@skill Investigation}) check against your spell save DC to be found.",
			"You decide what triggers the glyph when you cast the spell. For glyphs inscribed on a surface, the most typical triggers include touching or standing on the glyph, removing another object covering the glyph, approaching within a certain distance of the glyph, or manipulating the object on which the glyph is inscribed. For glyphs inscribed within an object, the most common triggers include opening that object, approaching within a certain distance of the object, or seeing or reading the glyph. Once a glyph is triggered, this spell ends.",
			"You can further refine the trigger so the spell activates only under certain circumstances or according to physical characteristics (such as height or weight), creature kind (for example, the ward could be set to affect aberrations or drow), or alignment. You can also set conditions for creatures that don't trigger the glyph, such as those who say a certain password.",
			"When you inscribe the glyph, choose explosive runes or a spell glyph.",
			{
				"type": "entries",
				"name": "Explosive Runes",
				"entries": [
					"When triggered, the glyph erupts with magical energy in a 20-foot-radius sphere centered on the glyph. The sphere spreads around corners. Each creature in the area must make a Dexterity saving throw. A creature takes {@damage 5d8} acid, cold, fire, lightning, or thunder damage on a failed saving throw (your choice when you create the glyph), or half as much damage on a successful one."
				]
			},
			{
				"type": "entries",
				"name": "Spell Glyph",
				"entries": [
					"You can store a prepared spell of 3rd level or lower in the glyph by casting it as part of creating the glyph. The spell must target a single creature or an area. The spell being stored has no immediate effect when cast in this way. When the glyph is triggered, the stored spell is cast. If the spell has a target, it targets the creature that triggered the glyph. If the spell affects an area, the area is centered on that creature. If the spell summons hostile creatures or creates harmful objects or traps, they appear as close as possible to the intruder and attack it. If the spell requires concentration, it lasts until the end of its full duration."
				]
			}
		],
		"entriesHigherLevel": [
			{
				"type": "entries",
				"name": "At Higher Levels",
				"entries": [
					"When you cast this spell using a spell slot of 4th level or higher, the damage of an explosive runes glyph increases by {@scaledamage 5d8|3-9|1d8} for each slot level above 3rd. If you create a spell glyph, you can store any spell of up to the same level as the slot you use for the glyph of warding."
				]
			}
		],
		"damageInflict": [
			"acid",
			"cold",
			"fire",
			"lightning",
			"thunder"
		],
		"savingThrow": [
			"dexterity"
		],
		"abilityCheck": [
			"intelligence"
		],
		"areaTags": [
			"S"
		],
		"classes": {
			"fromClassList": [
				{
					"name": "Bard",
					"source": "PHB"
				},
				{
					"name": "Cleric",
					"source": "PHB"
				},
				{
					"name": "Wizard",
					"source": "PHB"
				},
				{
					"name": "Artificer",
					"source": "UAArtificer"
				},
				{
					"name": "Artificer (Revisited)",
					"source": "UAArtificerRevisited"
				},
				{
					"name": "Artificer",
					"source": "TCE"
				}
			],
			"fromSubclass": [
				{
					"class": {
						"name": "Ranger",
						"source": "PHB"
					},
					"subclass": {
						"name": "Deep Stalker (UA)",
						"source": "UALightDarkUnderdark"
					}
				},
				{
					"class": {
						"name": "Ranger (Revised)",
						"source": "UATheRangerRevised"
					},
					"subclass": {
						"name": "Deep Stalker Conclave",
						"source": "UATheRangerRevised"
					}
				},
				{
					"class": {
						"name": "Sorcerer",
						"source": "PHB"
					},
					"subclass": {
						"name": "Clockwork Soul (UA)",
						"source": "UA2020SubclassesPt2"
					}
				}
			]
		},
		"races": [
			{
				"name": "Dwarf (Mark of Warding)",
				"source": "ERLW",
				"baseName": "Dwarf",
				"baseSource": "PHB"
			}
		],
		"backgrounds": [
			{
				"name": "Izzet Engineer",
				"source": "GGR"
			}
		]
	},
	{
		"name": "Mending",
		"source": "PHB",
		"page": 259,
		"srd": true,
		"level": 0,
		"school": "T",
		"time": [
			{
				"number": 1,
				"unit": "minute"
			}
		],
		"range": {
			"type": "point",
			"distance": {
				"type": "touch"
			}
		},
		"components": {
			"v": true,
			"s": true,
			"m": "two lodestones"
		},
		"duration": [
			{
				"type": "instant"
			}
		],
		"entries": [
			"This spell repairs a single break or tear in an object you touch, such as broken chain link, two halves of a broken key, a torn cloak, or a leaking wineskin. As long as the break or tear is no larger than 1 foot in any dimension, you mend it, leaving no trace of the former damage.",
			"This spell can physically repair a magic item or construct, but the spell can't restore magic to such an object."
		],
		"classes": {
			"fromClassList": [
				{
					"name": "Bard",
					"source": "PHB"
				},
				{
					"name": "Cleric",
					"source": "PHB"
				},
				{
					"name": "Druid",
					"source": "PHB"
				},
				{
					"name": "Sorcerer",
					"source": "PHB"
				},
				{
					"name": "Wizard",
					"source": "PHB"
				},
				{
					"name": "Artificer (Revisited)",
					"source": "UAArtificerRevisited"
				},
				{
					"name": "Artificer",
					"source": "TCE"
				}
			]
		},
		"races": [
			{
				"name": "Human (Mark of Making)",
				"source": "ERLW",
				"baseName": "Human",
				"baseSource": "PHB"
			}
		]
	},
	{
		"name": "Phantom Steed",
		"source": "PHB",
		"page": 265,
		"srd": true,
		"level": 3,
		"school": "I",
		"time": [
			{
				"number": 1,
				"unit": "minute"
			}
		],
		"range": {
			"type": "point",
			"distance": {
				"type": "feet",
				"amount": 30
			}
		},
		"components": {
			"v": true,
			"s": true
		},
		"duration": [
			{
				"type": "timed",
				"duration": {
					"type": "hour",
					"amount": 1
				}
			}
		],
		"meta": {
			"ritual": true
		},
		"entries": [
			"A Large quasi-real, horselike creature appears on the ground in an unoccupied space of your choice within range. You decide the creature's appearance, but it is equipped with a saddle, bit, and bridle. Any of the equipment created by the spell vanishes in a puff of smoke if it is carried more than 10 feet away from the steed.",
			"For the duration, you or a creature you choose can ride the steed. The creature uses the statistics for a {@creature riding horse}, except it has a speed of 100 feet and can travel 10 miles in an hour, or 13 miles at a fast pace. When the spell ends, the steed gradually fades, giving the rider 1 minute to dismount. The spell ends if you use an action to dismiss it or if the steed takes any damage."
		],
		"miscTags": [
			"SMN"
		],
		"classes": {
			"fromClassList": [
				{
					"name": "Wizard",
					"source": "PHB"
				}
			],
			"fromSubclass": [
				{
					"class": {
						"name": "Warlock",
						"source": "PHB"
					},
					"subclass": {
						"name": "Undead (UA)",
						"source": "UA2020SubclassesPt4"
					}
				}
			]
		},
		"races": [
			{
				"name": "Human (Mark of Passage)",
				"source": "ERLW",
				"baseName": "Human",
				"baseSource": "PHB"
			}
		]
	},
	{
		"name": "Wish",
		"source": "PHB",
		"page": 288,
		"srd": true,
		"level": 9,
		"school": "C",
		"time": [
			{
				"number": 1,
				"unit": "action"
			}
		],
		"range": {
			"type": "point",
			"distance": {
				"type": "self"
			}
		},
		"components": {
			"v": true
		},
		"duration": [
			{
				"type": "instant"
			}
		],
		"entries": [
			"Wish is the mightiest spell a mortal creature can cast. By simply speaking aloud, you can alter the very foundations of reality in accord with your desires.",
			"The basic use of this spell is to duplicate any other spell of 8th level or lower. You don't need to meet any requirements in that spell, including costly components. The spell simply takes effect. Alternatively, you can create one of the following effects of your choice:",
			{
				"type": "list",
				"items": [
					"You create one object of up to 25,000 gp in value that isn't a magic item. The object can be no more than 300 feet in any dimension, and it appears in an unoccupied space you can see on the ground.",
					"You allow up to twenty creatures that you can see to regain all hit points, and you end all effects on them described in the {@spell greater restoration} spell.",
					"You grant up to ten creatures that you can see resistance to a damage type you choose.",
					"You grant up to ten creatures you can see immunity to a single spell or other magical effect for 8 hours. For instance, you could make yourself and all your companions immune to a {@creature lich}'s life drain attack.",
					"You undo a single recent event by forcing a reroll of any roll made within the last round (including your last turn). Reality reshapes itself to accommodate the new result. For example, a wish spell could undo an opponent's successful save, a foe's critical hit, or a friend's failed save. You can force the reroll to be made with advantage or disadvantage, and you can choose whether to use the reroll or the original roll."
				]
			},
			"You might be able to achieve something beyond the scope of the above examples. State your wish to the DM as precisely as possible. The DM has great latitude in ruling what occurs in such an instance; the greater the wish, the greater the likelihood that something goes wrong. This spell might simply fail, the effect you desire might only be partly achieved, or you might suffer some unforeseen consequence as a result of how you worded the wish. For example, wishing that a villain were dead might propel you forward in time to a period when that villain is no longer alive, effectively removing you from the game. Similarly, wishing for a legendary magic item or artifact might instantly transport you to the presence of the item's current owner.",
			"The stress of casting this spell to produce any effect other than duplicating another spell weakens you. After enduring that stress, each time you cast a spell until you finish a long rest, you take {@damage 1d10} necrotic damage per level of that spell. This damage can't be reduced or prevented in any way. In addition, your Strength drops to 3, if it isn't 3 or lower already, for {@dice 2d4} days. For each of those days that you spend resting and doing nothing more than light activity, your remaining recovery time decreases by 2 days. Finally, there is a {@chance 33} chance that you are unable to cast wish ever again if you suffer this stress."
		],
		"damageResist": [
			"acid",
			"bludgeoning",
			"cold",
			"fire",
			"force",
			"lightning",
			"necrotic",
			"piercing",
			"poison",
			"psychic",
			"radiant",
			"slashing",
			"thunder"
		],
		"damageInflict": [
			"necrotic"
		],
		"miscTags": [
			"HL",
			"SGT"
		],
		"classes": {
			"fromClassList": [
				{
					"name": "Sorcerer",
					"source": "PHB"
				},
				{
					"name": "Wizard",
					"source": "PHB"
				}
			],
			"fromSubclass": [
				{
					"class": {
						"name": "Warlock",
						"source": "PHB"
					},
					"subclass": {
						"name": "Genie (UA)",
						"source": "UA2020SubclassesRevisited"
					}
				},
				{
					"class": {
						"name": "Warlock",
						"source": "PHB"
					},
					"subclass": {
						"name": "Genie",
						"source": "TCE"
					}
				}
			]
		}
	},
	{
		"name": "Booming Blade",
		"source": "TCE",
		"page": 106,
		"otherSources": [
			{
				"source": "SCAG",
				"page": 142
			}
		],
		"level": 0,
		"school": "V",
		"time": [
			{
				"number": 1,
				"unit": "action"
			}
		],
		"range": {
			"type": "radius",
			"distance": {
				"type": "feet",
				"amount": 5
			}
		},
		"components": {
			"s": true,
			"m": {
				"text": "a melee weapon worth at least 1 sp",
				"cost": 10
			}
		},
		"duration": [
			{
				"type": "timed",
				"duration": {
					"type": "round",
					"amount": 1
				}
			}
		],
		"entries": [
			"You brandish the weapon used in the spell's casting and make a melee attack with it against one creature within 5 feet of you. On a hit, the target suffers the weapon attack's normal effects and then becomes sheathed in booming energy until the start of your next turn. If the target willingly moves 5 feet or more before then, the target takes {@damage 1d8} thunder damage, and the spell ends.",
			"This spell's damage increases when you reach certain levels. At 5th level, the melee attack deals an extra {@damage 1d8} thunder damage to the target on a hit, and the damage the target takes for moving increases to {@damage 2d8}. Both damage rolls increase by 1d8 at 11th level ({@damage 2d8} and {@damage 3d8}) and again at 17th level ({@damage 3d8} and {@damage 4d8})."
		],
		"scalingLevelDice": [
			{
				"label": "thunder damage on moving",
				"scaling": {
					"1": "1d8",
					"5": "2d8",
					"11": "3d8",
					"17": "4d8"
				}
			},
			{
				"label": "thunder damage on hit",
				"scaling": {
					"5": "1d8",
					"11": "2d8",
					"17": "3d8"
				}
			}
		],
		"damageInflict": [
			"thunder"
		],
		"miscTags": [
			"SCL"
		],
		"areaTags": [
			"ST"
		],
		"classes": {
			"fromClassList": [
				{
					"name": "Artificer",
					"source": "TCE"
				},
				{
					"name": "Sorcerer",
					"source": "PHB",
					"definedInSource": "SCAG"
				},
				{
					"name": "Warlock",
					"source": "PHB",
					"definedInSource": "SCAG"
				},
				{
					"name": "Wizard",
					"source": "PHB",
					"definedInSource": "SCAG"
				}
			],
			"fromClassListVariant": [
				{
					"name": "Sorcerer",
					"source": "PHB",
					"definedInSource": "TCE"
				},
				{
					"name": "Warlock",
					"source": "PHB",
					"definedInSource": "TCE"
				},
				{
					"name": "Wizard",
					"source": "PHB",
					"definedInSource": "TCE"
				}
			]
		}
	}
]